; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-3-3)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	person1 - person
	person2 - person
	person3 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	)
(:init
	(at plane1 city1)
	(= (capacity plane1) 2333)
	(= (fuel plane1) 95)
	(= (slow-burn plane1) 1)
	(= (fast-burn plane1) 3)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 4)
	(at plane2 city1)
	(= (capacity plane2) 4596)
	(= (fuel plane2) 1729)
	(= (slow-burn plane2) 2)
	(= (fast-burn plane2) 4)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 1)
	(at plane3 city5)
	(= (capacity plane3) 11301)
	(= (fuel plane3) 678)
	(= (slow-burn plane3) 4)
	(= (fast-burn plane3) 14)
	(= (onboard plane3) 0)
	(= (zoom-limit plane3) 1)
	(at person1 city3)
	(at person2 city5)
	(at person3 city4)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 958)
	(= (distance city0 city2) 566)
	(= (distance city0 city3) 595)
	(= (distance city0 city4) 630)
	(= (distance city0 city5) 607)
	(= (distance city1 city0) 958)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 680)
	(= (distance city1 city3) 709)
	(= (distance city1 city4) 827)
	(= (distance city1 city5) 597)
	(= (distance city2 city0) 566)
	(= (distance city2 city1) 680)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 654)
	(= (distance city2 city4) 753)
	(= (distance city2 city5) 557)
	(= (distance city3 city0) 595)
	(= (distance city3 city1) 709)
	(= (distance city3 city2) 654)
	(= (distance city3 city3) 0)
	(= (distance city3 city4) 785)
	(= (distance city3 city5) 835)
	(= (distance city4 city0) 630)
	(= (distance city4 city1) 827)
	(= (distance city4 city2) 753)
	(= (distance city4 city3) 785)
	(= (distance city4 city4) 0)
	(= (distance city4 city5) 963)
	(= (distance city5 city0) 607)
	(= (distance city5 city1) 597)
	(= (distance city5 city2) 557)
	(= (distance city5 city3) 835)
	(= (distance city5 city4) 963)
	(= (distance city5 city5) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at person1 city4)
	(at person2 city5)
	(at person3 city1)
	))

(:metric minimize (+ (* 5 (total-time))  (* 1 (total-fuel-used))))
)

; plan
1. (fly plane2 city1 city3)
   deleted: (at plane2 city1)
   added: (at plane2 city3)
   changed: (total-fuel-used) from 0 to 1418, (fuel plane2) from 1729 to 311
   goals met: 1 of 3
2. (board person1 plane2 city3)
   deleted: (at person1 city3)
   added: (in person1 plane2)
   changed: (onboard plane2) from 0 to 1
   goals met: 1 of 3
3. (refuel plane2 city3)
   changed: (fuel plane2) from 311 to 4596
   goals met: 1 of 3
4. (fly plane2 city3 city4)
   deleted: (at plane2 city3)
   added: (at plane2 city4)
   changed: (total-fuel-used) from 1418 to 2988, (fuel plane2) from 4596 to 3026
   goals met: 1 of 3
5. (debark person1 plane2 city4)
   deleted: (in person1 plane2)
   added: (at person1 city4)
   changed: (onboard plane2) from 1 to 0
   goals met: 2 of 3
6. (board person3 plane2 city4)
   deleted: (at person3 city4)
   added: (in person3 plane2)
   changed: (onboard plane2) from 0 to 1
   goals met: 2 of 3
7. (fly plane2 city4 city1)
   deleted: (at plane2 city4)
   added: (at plane2 city1)
   changed: (total-fuel-used) from 2988 to 4642, (fuel plane2) from 3026 to 1372
   goals met: 2 of 3
8. (debark person3 plane2 city1)
   deleted: (in person3 plane2)
   added: (at person3 city1)
   changed: (onboard plane2) from 1 to 0
   goals met: 3 of 3
